Revit 2024 API
StructuralSettings.BoundaryConditionAreaAndLineSymbolSpacing Property
 Symbol spacing for boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double BoundaryConditionAreaAndLineSymbolSpacing { get; set; }
Visual Basic
Public Property BoundaryConditionAreaAndLineSymbolSpacing As Double
	Get
	Set
Visual C++
public:
property double BoundaryConditionAreaAndLineSymbolSpacing {
	double get ();
	void set (double value);
}
See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace